Revit 2027 API
BuiltInFailures.StairRampFailures.WinderRunCreationFailure Property
 The relationship between the current values of Actual Run Width, Minimum Width at Inside Boundary, and Parallel Treads at Start or End does not support the creation of the winder run.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WinderRunCreationFailure { get; }
Public Shared ReadOnly Property WinderRunCreationFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WinderRunCreationFailure {
	FailureDefinitionId^ get ();
}
static member WinderRunCreationFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace